InformationRegisters/ВАТСоповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВАТСоповещения</Name>
			<Comment>Оповещения от ВАТС для показа пользователям</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>user</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>numFrom</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>processed</Name>
					<Comment>Запись обработана</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>state</Name>
					<Comment>PREANSWER (показываем в трее), ANSWER (показываем форму События)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>utmString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВАТСоповещения/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьОповещение(Данные) Экспорт
	
	Если Данные.direction = "incoming" И СтрДлина(Данные.from) < 7 
		ИЛИ Данные.direction = "external" И СтрДлина(Данные.to) < 7 
	Тогда	
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Данные.Пользователь) Тогда
		// Если показать некому, то такая запись не нужна
		МенеджерЗаписи = РегистрыСведений.ВАТСоповещения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.id = Новый УникальныйИдентификатор;
		МенеджерЗаписи.date	= ТекущаяДата();
		МенеджерЗаписи.numFrom = Данные.from;
		МенеджерЗаписи.user	= Данные.Пользователь;
		МенеджерЗаписи.state = Данные.state;
		МенеджерЗаписи.utmString = Данные.utmString;
		МенеджерЗаписи.Записать();	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗарегистрироватьОповещениеДокументТелефонныйЗвонок(Объект) Экспорт

	МенеджерЗаписи = РегистрыСведений.ВАТСоповещения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.id = Новый УникальныйИдентификатор;
	МенеджерЗаписи.date	= ТекущаяДата();
	МенеджерЗаписи.user	= Объект.Ответственный;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Записать();	

КонецПроцедуры
